In [1]:
import pandas as pd
import numpy as np

### eksik verilerle çalışmak

In [4]:
sozlukVerisi ={"Istanbul" : [30, 29, np.nan],"Ankara" : [20, np.nan, 25],"Izmir": [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [5]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [6]:
havaDurumuDataFrame ["Gunler"] = ["Pazartesi","Salı","Çarşamba"]

In [7]:
havaDurumuDataFrame.set_index("Gunler", inplace = True)

In [8]:
havaDurumuDataFrame

           Istanbul  Ankara  Izmir
Gunler
Pazartesi      30.0    20.0     40
Salı           29.0     NaN     39
Çarşamba        NaN    25.0     38

In [9]:
havaDurumuDataFrame.dropna()

           Istanbul  Ankara  Izmir
Gunler
Pazartesi      30.0    20.0     40

In [11]:
havaDurumuDataFrame

           Istanbul  Ankara  Izmir
Gunler
Pazartesi      30.0    20.0     40
Salı           29.0     NaN     39
Çarşamba        NaN    25.0     38

In [12]:
havaDurumuDataFrame.dropna(axis = 1)

           Izmir
Gunler
Pazartesi     40
Salı          39
Çarşamba      38

In [13]:
yeniVeri ={"Istanbul" : [30, 29, np.nan],"Ankara" : [20, np.nan, 25],"Izmir": [40,39,38], "Antalya": [45, np.nan, np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [15]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [17]:
yeniDataFrame.dropna(axis = 1, thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [18]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [23]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

In [24]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

### groupby

In [40]:
maasSozlugu = {"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Çalışan Ismi" :["Ahmet","Mehmet","Zeynep","Atıl","Burak","Fatma"],
               "Maas" : [3000, 3500, 4000, 4500, 5000, 5500]
              }

In [41]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [42]:
maasDataFrame

   Departman Çalışan Ismi  Maas
0    Yazılım        Ahmet  3000
1    Yazılım       Mehmet  3500
2  Pazarlama       Zeynep  4000
3  Pazarlama         Atıl  4500
4      Hukuk        Burak  5000
5      Hukuk        Fatma  5500

In [44]:
grupObj = maasDataFrame.groupby("Departman")

In [45]:
grupObj.count()

           Çalışan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [46]:
grupObj.mean()

           Maas
Departman
Hukuk      5250
Pazarlama  4250
Yazılım    3250

In [47]:
grupObj.min()

          Çalışan Ismi  Maas
Departman
Hukuk            Burak  5000
Pazarlama         Atıl  4000
Yazılım          Ahmet  3000

In [48]:
grupObj.describe()

           Maas
          count    mean         std     min     25%     50%     75%     max
Departman
Hukuk       2.0  5250.0  353.553391  5000.0  5125.0  5250.0  5375.0  5500.0
Pazarlama   2.0  4250.0  353.553391  4000.0  4125.0  4250.0  4375.0  4500.0
Yazılım     2.0  3250.0  353.553391  3000.0  3125.0  3250.0  3375.0  3500.0